{
  "release": "v3.9 RC3",
  "lastUpdated": "2024-05-14T12:00:00.000Z",
  "defects": [
    {
      "id": "DEF-001",
      "title": "Requirement edits lost when switching test cases",
      "description": "Switching test cases before saving a shared requirement template discards unsaved changes. Warn users or auto-save the template before navigation.",
      "severity": "Medium",
      "status": "Resolved",
      "owner": "QA",
      "lastUpdated": "2024-05-10T12:00:00.000Z"
    },
    {
      "id": "DEF-002",
      "title": "Report tab omits template metadata",
      "description": "Traceability report does not list the requirement template name being applied which makes auditing difficult.",
      "severity": "Low",
      "status": "Resolved",
      "owner": "Systems",
      "lastUpdated": "2024-05-10T12:00:00.000Z"
    },
    {
      "id": "DEF-003",
      "title": "Manual distances ignored when templates also define ranges",
      "description": "If a tester records axis distances inside a test case, the report and comparison views continue to show the template's \"must not respond\" range instead of the recorded override, making it impossible to validate the actual field measurements.",
      "severity": "Medium",
      "status": "Resolved",
      "owner": "QA",
      "lastUpdated": "2024-05-12T12:00:00.000Z"
    },
    {
      "id": "DEF-004",
      "title": "Comparison cards hide axis context",
      "description": "When an execution is added to the comparison dashboard with a specific axis filter, the card never shows which axis/direction or distance bounds were applied. Reviewers cannot tell why runs fail without opening the original test case.",
      "severity": "Low",
      "status": "Resolved",
      "owner": "Systems",
      "lastUpdated": "2024-05-12T12:00:00.000Z"
    },
    {
      "id": "DEF-005",
      "title": "Defect register search ignores IDs and severities",
      "description": "The defect register only filters on titles/descriptions. QA cannot quickly isolate Critical defects or look up tickets by their ID, forcing manual scans of long lists.",
      "severity": "Medium",
      "status": "Resolved",
      "owner": "QA",
      "lastUpdated": "2024-05-12T12:00:00.000Z"
    },
    {
      "id": "DEF-006",
      "title": "Default FPS conversions hide long latencies",
      "description": "When a CSV omits explicit FPS metadata the parser locks to 30 fps, producing 1.500s deltas for clips that actually ran closer to 1.8s. Users need both visibility into the detection source and a way to recalculate latencies when the rate is wrong.",
      "severity": "Medium",
      "status": "Resolved",
      "owner": "QA",
      "lastUpdated": "2024-05-14T12:00:00.000Z"
    },
    {
      "id": "DEF-007",
      "title": "Axis comparison lacks a dedicated matrix",
      "description": "The comparison dashboard lists per-execution cards only, so there is no dedicated axis view or visual highlight showing which direction is being evaluated. Reviewers cannot quickly align the same axis across runs.",
      "severity": "Low",
      "status": "Resolved",
      "owner": "Systems",
      "lastUpdated": "2024-05-14T12:00:00.000Z"
    }
  ]
}
